In [47]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

## マージ

In [2]:
dframe1 = DataFrame({'key':list('XZYZXX'), 'data_set_1':np.arange(6)})

In [3]:
dframe1

  key  data_set_1
0   X           0
1   Z           1
2   Y           2
3   Z           3
4   X           4
5   X           5

In [4]:
 dframe2 = DataFrame({'key':list('QYZ'), 'data_set_2':np.arange(3)})

In [5]:
dframe2

  key  data_set_2
0   Q           0
1   Y           1
2   Z           2

In [6]:
pd.merge(dframe1,dframe2)

  key  data_set_1  data_set_2
0   Z           1           2
1   Z           3           2
2   Y           2           1

(INNER JOIN)

In [8]:
pd.merge(dframe1, dframe2, on='key')

  key  data_set_1  data_set_2
0   Z           1           2
1   Z           3           2
2   Y           2           1

(LEFT JOIN)

In [9]:
pd.merge(dframe1, dframe2, on='key', how='left')

  key  data_set_1  data_set_2
0   X           0         NaN
1   Z           1         2.0
2   Y           2         1.0
3   Z           3         2.0
4   X           4         NaN
5   X           5         NaN

(RIGHT JOIN)

In [11]:
pd.merge(dframe1, dframe2, on='key', how='right')

  key  data_set_1  data_set_2
0   Z         1.0           2
1   Z         3.0           2
2   Y         2.0           1
3   Q         NaN           0

(OUTER JOIN)

In [12]:
pd.merge(dframe1, dframe2, on='key', how='outer')

  key  data_set_1  data_set_2
0   X         0.0         NaN
1   X         4.0         NaN
2   X         5.0         NaN
3   Z         1.0         2.0
4   Z         3.0         2.0
5   Y         2.0         1.0
6   Q         NaN         0.0

In [13]:
dframe3 = DataFrame({'key':list('XXXYZZ'), 'data_set_3': range(6)})

In [15]:
dframe4 = DataFrame({'key':list('YYXXZ'), 'data_set_4': range(5)})

In [16]:
dframe3

  key  data_set_3
0   X           0
1   X           1
2   X           2
3   Y           3
4   Z           4
5   Z           5

In [17]:
dframe4

  key  data_set_4
0   Y           0
1   Y           1
2   X           2
3   X           3
4   Z           4

多対多
- Xが6行になる(3x2)

In [18]:
pd.merge(dframe3, dframe4)

  key  data_set_3  data_set_4
0   X           0           2
1   X           0           3
2   X           1           2
3   X           1           3
4   X           2           2
5   X           2           3
6   Y           3           0
7   Y           3           1
8   Z           4           4
9   Z           5           4

In [27]:
df_left = DataFrame({'key1':['SF','SF','LA'],
                    'key2':['one','two','two'],
                    'left_data':[10,20,30]})

In [28]:
df_right = DataFrame({'key1':['SF','SF','LA','LA'],
                    'key2':['one','one','two','two'],
                     'right_data':[10,20,30,40]})

In [30]:
pd.merge(df_left,df_right, on=['key1','key2'], how='outer')

  key1 key2  left_data  right_data
0   SF  one         10        10.0
1   SF  one         10        20.0
2   SF  two         20         NaN
3   LA  two         30        30.0
4   LA  two         30        40.0

suffix付きで表示される

In [31]:
pd.merge(df_left,df_right, on='key1')

  key1 key2_x  left_data key2_y  right_data
0   SF    one         10    one          10
1   SF    one         10    one          20
2   SF    two         20    one          10
3   SF    two         20    one          20
4   LA    two         30    two          30
5   LA    two         30    two          40

### Indexを利用したマージ

In [33]:
df_left1 = DataFrame({'key':list('XYZXY'),
                     'data': range(5)})

In [41]:
# index付き
df_right1 = DataFrame({'group_date':[10,20]}, index=['X','Y'])

In [36]:
df_left1

  key  data
0   X     0
1   Y     1
2   Z     2
3   X     3
4   Y     4

In [42]:
df_right1

   group_date
X          10
Y          20

In [43]:
pd.merge(df_left1, df_right1, left_on='key',right_index=True)

  key  data  group_date
0   X     0          10
3   X     3          10
1   Y     1          20
4   Y     4          20

In [44]:
pd.merge(df_left1, df_right1, left_on='key',right_index=True, how='outer')

  key  data  group_date
0   X     0        10.0
3   X     3        10.0
1   Y     1        20.0
4   Y     4        20.0
2   Z     2         NaN

(※ 実際にはjoinを多く利用する)

In [46]:
df_left1.join(df_right1)

  key  data  group_date
0   X     0         NaN
1   Y     1         NaN
2   Z     2         NaN
3   X     3         NaN
4   Y     4         NaN

## 連結

In [48]:
arr1 = np.arange(9).reshape((3,3))

In [51]:
np.concatenate([arr1,arr1],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [53]:
ser1 = Series([0,1,2],index=['T','U','V'])
ser2 = Series([3,4],index=['X','Y'])

In [54]:
pd.concat([ser1,ser2])

T    0
U    1
V    2
X    3
Y    4
dtype: int64

In [56]:
pd.concat([ser1,ser2],axis=1,sort=True)

     0    1
T  0.0  NaN
U  1.0  NaN
V  2.0  NaN
X  NaN  3.0
Y  NaN  4.0

## データの組み合わせ

In [61]:
ser3 = Series([2, np.nan, 4, np.nan, 6, np.nan],
             index=list('QRSTUV'))
ser4 = Series(np.arange(len(ser3), dtype=np.float64),
             index=list('QRSTUV'))

条件付きでSeries作成

In [64]:
Series(np.where(pd.isnull(ser3),ser4,ser3), index=ser3.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [65]:
ser3.combine_first(ser4)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [67]:
dframe5 = DataFrame({'X':[1,np.nan,3,np.nan],
                    'Y':[np.nan,5,np.nan,7],
                    'Z':[np.nan,9,np.nan,11]})

In [68]:
dframe5

     X    Y     Z
0  1.0  NaN   NaN
1  NaN  5.0   9.0
2  3.0  NaN   NaN
3  NaN  7.0  11.0

In [69]:
dframe6 = DataFrame({'X':[2,4,np.nan,6,8],
                    'Y':[np.nan,10,12,14,16]})

In [70]:
dframe6

     X     Y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [71]:
dframe5.combine_first(dframe6)

     X     Y     Z
0  1.0   NaN   NaN
1  4.0   5.0   9.0
2  3.0  12.0   NaN
3  6.0   7.0  11.0
4  8.0  16.0   NaN